tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "user/tap-repo", "https://github.com/gooqiao/sync.git"
tap "vitorgalvao/tiny-scripts"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Mac App Store command-line interface
brew "mas"
# Open source relational database management system
brew "mysql@5.7", restart_service: true
# Platform built on V8 to build network applications
brew "node"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extract, view, and test RAR archives
brew "unrar"
# Internet file retriever
brew "wget"
# Quickly repair outdated/broken Casks from homebrew-cask
brew "vitorgalvao/tiny-scripts/cask-repair"
cask "charles"
cask "dash"
cask "eudic"
cask "google-chrome"
cask "hammerspoon"
cask "istat-menus"
cask "iterm2"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "keyboard-maestro"
cask "kindle"
cask "launchbar"
cask "moom"
cask "mos"
cask "oracle-jdk"
cask "popclip"
cask "postman"
cask "shadowsocksx-ng-r"
cask "showyedge"
cask "teamviewer"
cask "termius"
cask "visual-studio-code"
cask "vmware-fusion"
mas "Keynote 讲演", id: 409183694
mas "Numbers 表格", id: 409203825
mas "Pages 文稿", id: 409201541
mas "WPS Office", id: 1443749478
mas "库乐队", id: 682658836
mas "微信", id: 836500024
mas "网易云音乐", id: 944848654
mas "钉钉", id: 1435447041

# append
brew "fzf"
